'''
Задание 1.
Поработайте с переменными, создайте несколько, выведите на экран.
Запросите у пользователя некоторые числа и строки и сохраните в переменные, затем выведите на экран.
'''
var_1 = 10
var_2 = "Какая-то строка"
print("Переменные:", var_1, "и", var_2)
var_1 = int(input("Введите число: "))
print("Введено число", var_1)
var_2 = input("Введите какой-нибудь текст: ")
print("Введен текст:", var_2)
