"""
Задание 3.
Пользователь вводит месяц в виде целого числа от 1 до 12.
Сообщить, к какому времени года относится месяц (зима, весна, лето, осень).
Напишите решения через list и dict.
"""
# Решение через dict
seasons_list = {"M_1": "Зима", "M_2": "Зима", "M_3": "Весна", "M_4": "Весна",
                "M_5": "Весна", "M_6": "Лето", "M_7": "Лето", "M_8": "Лето",
                "M_9": "Осень", "M_10": "Осень", "M_11": "Осень",
                "M_12": "Зима"}
month = int(input("Введите номер месяца: "))
if 12 < month or month < 1:
    print(f"Ввод некорректный. Нет месяца с номером {month}")
else:
    print(f"Номер месяца: {month},"
          f"сезон: {seasons_list.get('M_' + str(month))}")
